Repository: ShohninDmitriy/OctoPrint-PrintTimeGenius
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: All gcode analyzers (usually not as good as marlin-calc)
ru: Все анализаторы Gcode (обычно не так хороши, как marlin-calk)

source: Marlin firmware simulation (replaces Octoprint built-in, faster and more accurate)
ru: Marlin firmware симулятор (заменяет Octoprint встроенный, быстрее и точнее)

source: Use Slic3r PE M73 time remaining
ru: Использовать Slic3r PE M73 оставшееся время

source: Based on a line-by-line preprocessing of the gcode (good accuracy)
ru: На основе построчной предварительной обработки gcode (хорошая точность)

source: General options
ru: Основные параметры

source: Display precise durations instead of fuzzy ones
ru: Отображение точных длительностей вместо нечетких

source: Enable OctoPrint's built-in analyzer (slow and unnecessary)
ru: Включить встроенный анализатор OctoPrint (медленный и ненужный)

source: Analyzing a file while heating should not affect performace.
ru: Анализ файла при нагревании не должен влиять на выполнение.

source: Allow analysis while heating (only takes effect after saving)
ru: Разрешить анализ во время нагрева (вступает в силу только после сохранения)

source: Analyzing a file while printing might cause poor printing performace.
ru: Анализ файла во время печати может привести к снижению производительности печати.

source: Allow analysis while printing (only takes effect after saving)
ru: Разрешить анализ во время печати (вступает в силу только после сохранения)

source: May slow down your printer
ru: Может замедлить работу принтера

source: Analyzers
ru: Анализаторы

source: Analyze
ru: Анализ

source: You can use this to run an analysis right now and also look at the output to debug problems.
ru: Вы можете использовать это для запуска анализа прямо сейчас, а также посмотреть на выходные данные для отладки проблем.

source: File to analyze:
ru: Файл для анализа

source: Choose...
ru: Выбор...

source: Advanced
ru: Дополнительные параметры

source: The default analyzers are the suggested settings for all users
ru: Анализаторы по умолчанию являются предлагаемыми настройками для всех пользователей

source: Reset analyzers to default
ru: Сбросить на начальные настройки

source: Description
ru: Описание

source: Command
ru: Команда

source: Enabled
ru: Включенный

source: Remove analyzer
ru: Удалить анализатор

source: Add analyzer
ru: Добавить анализатор

source: Debug
ru: Отладка

source: Debug Analysis
ru: Отладка Анализа

source: Analyze a file and then <a href="downloads/logs/plugin_PrintTimeGenius_engine.log">download the log</a>. If you see errors, <a href="https://github.com/eyal0/OctoPrint-PrintTimeGenius/issues">report them</a>.
ru: Проанализируйте файл, а затем <a href="downloads/logs/plugin_PrintTimeGenius_engine.log">скачайте журнал</a>. Если вы видите ошибки, <a href="https://github.com/eyal0/OctoPrint-PrintTimeGenius/issues">сообщить о них</a>.

source: Debug Estimates
ru: Отладка Оценок

source: If you want to make a graph of the print time estimate and compare with OctoPrint's built-in estimates: <ol> <li>In settings, go to Logging.</li> <li>Set "octoprint.plugins.PrintTimeGenius" level to "DEBUG".</li> <li>Click on the blue plus.</li> <li>Click on save.</li> </ol> </p> <p> Now print something and the log will fill with a <a href="https://en.wikipedia.org/wiki/Comma-separated_values">csv</a>. <a href="downloads/logs/plugin_PrintTimeGenius_engine.log">Download the log</a>, remove unnecessary lines, and import to a spreadsheet. </p>
ru: Если вы хотите построить график оценки времени печати и сравнить его со встроенной оценкой OctoPrint: <ol> <li>В разделе Настройки перейдите к Журналированию.</li> <li>Набор "octoprint.plugins.PrintTimeGenius" на "отладка".</li> <li>Нажмите на синий плюс.</li> <li>Нажмите кнопку Сохранить.</li> </ol> </p> <p> Теперь напечатайте что-нибудь, и журнал заполнится<a href="https://en.wikipedia.org/wiki/Comma-separated_values">csv</a>. <a href="downloads/logs/plugin_PrintTimeGenius_engine.log">Скачайте журнал</a>,удалите ненужные строки и импортируйте их в электронную таблицу. </p>

source: Compensation values
ru: Значения компенсации

source: Actual
ru: Фактический

source: Predicted
ru: Предсказанный

source: Compensated
ru: Компенсированный

source: Heating
ru: Нагрев

source: Extruding
ru: Выдавливание

source: Cooling
ru: Охлаждение

source: Total
ru: Весь

source: Remove row, if this is an atypical sample and shouldn't be used for future compensation
ru: Удалите строку, если это нетипичный образец и не должен использоваться для будущей компенсации
